app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "position", "department", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Tuan Le"], ["position", "Backend Developer"], ["department", "IT"], ["salary", 500.0], ["created_at", "2024-08-12 11:22:10.549957"], ["updated_at", "2024-08-12 11:22:10.549957"]]
---
  def create
    @employee = Employee.new(employee_params)
    if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "salary" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["salary", 5.0], ["updated_at", "2024-08-12 14:43:18.045293"], ["id", 3]]
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy